ПерваяЗадачаЧасть1/src/Documents/РасходТоваров/РасходТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходТоваров</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПерваяЗадачаЧасть1/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ПерваяЗадачаЧасть1/src/Documents/РасходТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

    ОстатковХватает  = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Запрос = Новый Запрос();
    Запрос.Текст = "ВЫБРАТЬ
    |	РасходТоваровТовары.Номенклатура КАК Номенклатура,
    |	СУММА(РасходТоваровТовары.Количество) КАК Количество
    |ИЗ
    |	Документ.РасходТоваров.Товары КАК РасходТоваровТовары
    |ГДЕ
    |	РасходТоваровТовары.Ссылка = &СсылкаДокумента
    |СГРУППИРОВАТЬ ПО
    |	РасходТоваровТовары.Номенклатура";
    Запрос.УстановитьПараметр("СсылкаДокумента", Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    Если РезультатЗапроса.Пустой() Тогда
    	Возврат
    КонецЕсли;
    
    // Проведение документа
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
    	
    	Отбор = Новый Структура();
    	Отбор.Вставить("Склад", Склад);
    	Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
    	ОстаткиТЗ = РегистрыНакопления.ОстаткиНоменклатуры.Остатки(, Отбор);
    	ОстатокПоНоменклатуре = ОстаткиТЗ[0].Количество;
    	
    	Если ОстатокПоНоменклатуре < Выборка.Количество Тогда // контроль остатков
    		ОстатковХватает = Ложь;
    		Сообщить("Для номенклатуры " + Выборка.Номенклатура 
    		         + " нельзя провести: " + Строка(Выборка.Количество) 
    		         + " так как в запасах только: " + Строка(ОстатокПоНоменклатуре));
    	КонецЕсли;
 
    	Движение              = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Движение.Период       = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад        = Склад;
		Движение.Количество   = Выборка.Количество;
    КонецЦикла;
    
    // Не проводим документ если не хватает остатков хотя бы по одной номенклатуре
	Отказ = ?(ОстатковХватает, Ложь, Истина);

КонецПроцедуры
